updated NodeJS docs
